Revit 2027 API
TextNote.LeaderRightAttachment Property
 Attachment position of leaders on the right side of the text note.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public LeaderAtachement LeaderRightAttachment { get; set; }
Public Property LeaderRightAttachment As LeaderAtachement
	Get
	Set
public:
property LeaderAtachement LeaderRightAttachment {
	LeaderAtachement get ();
	void set (LeaderAtachement value);
}
member LeaderRightAttachment : LeaderAtachement with get, set
Property Value
LeaderAtachement
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Remarks
The property controls the vertical position of leaders attached to the right side of the note.
Change of the value will affect all leaders currently attached to the right side.
See Also
Reference
TextNote Class
Autodesk.Revit.DB Namespace